# Делу — время, потехе — час
# Давайте передохнём от автоматизации и сделаем # что-то действительно интересное.

# Формат ввода:
# Одно натуральное число N

# Формат вывода:
# N строк с фразой: "Купи слона!"

N = int(input(""))
i = "Купи слона!"
x = str(i) + '\n'
res = str(x) * int(N)
print(res)